#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.manage_roles will be updated in-place
  ~ resource "aws_iam_policy" "manage_roles" {
        id          = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/ManageRoles"
        name        = "ManageRoles"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          + "iam:TagRole",
                            "iam:PutRolePolicy",
                            # (2 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.test_role will be created
  + resource "aws_iam_role" "test_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test_role"
      + name_prefix           = (known after apply)
      + path                  = "/IacGhcPipelineResourceManagerRoles/"
      + tags_all              = {
          + "Developer"      = "StratusGrid"
          + "Environment"    = "dev"
          + "Provisioner"    = "Terraform"
          + "Region_Purpose" = "Active"
          + "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          + "Terraform"      = "true"
        }
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
